In [2]:
import pandas as pd

In [3]:
df = pd.util.testing.makeMixedDataFrame()
df

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

## Delete columns

**Drop the `column`**

In [5]:
df_drop_column = df.drop(['B','D'], axis=1)
df_drop_column

     A     C
0  0.0  foo1
1  1.0  foo2
2  2.0  foo3
3  3.0  foo4
4  4.0  foo5

**Drop the `row`**

In [6]:
df_drop_row = df.drop(1)
df_drop_row

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

---
---

## Add columns

In [9]:
data = [
    ['Ali',
     'Azmat',
     '30'],
    ['Sharukh',
     'Khan',
     '40'],
    ['Linus',
     'Torvalds',
     '70']
]
df1 = pd.DataFrame(data,columns=['First','Last','Age'])
df1

     First      Last Age
0      Ali     Azmat  30
1  Sharukh      Khan  40
2    Linus  Torvalds  70

***Using `[]`***

In [10]:
city = ['Lahore','Dehli','New York']
df1['city'] = city
df1

     First      Last Age      city
0      Ali     Azmat  30    Lahore
1  Sharukh      Khan  40     Dehli
2    Linus  Torvalds  70  New York

***Using `df.insert()`***

In [11]:
df1.insert(4,'Height',[180,175,170],True)
df1

     First      Last Age      city  Height
0      Ali     Azmat  30    Lahore     180
1  Sharukh      Khan  40     Dehli     175
2    Linus  Torvalds  70  New York     170

***Using `df.assign()`***

In [12]:
df2 = df1.assign(score = [20,30,40],
                 Sex = ['Male','Male','Female'])
df2

     First      Last Age      city  Height  score     Sex
0      Ali     Azmat  30    Lahore     180     20    Male
1  Sharukh      Khan  40     Dehli     175     30    Male
2    Linus  Torvalds  70  New York     170     40  Female

***Using `loc`***

In [14]:
df2.loc[:, 'Team'] = ['Lakers','Nets','Clippers']
df2

     First      Last Age      city  Height  score     Sex      Team
0      Ali     Azmat  30    Lahore     180     20    Male    Lakers
1  Sharukh      Khan  40     Dehli     175     30    Male      Nets
2    Linus  Torvalds  70  New York     170     40  Female  Clippers

***Using `concat`***

In [15]:
df3 = pd.concat([df2, pd.DataFrame(columns=['d','e'])], sort=False)
df3

     First      Last Age      city  Height  score     Sex      Team    d    e
0      Ali     Azmat  30    Lahore   180.0   20.0    Male    Lakers  NaN  NaN
1  Sharukh      Khan  40     Dehli   175.0   30.0    Male      Nets  NaN  NaN
2    Linus  Torvalds  70  New York   170.0   40.0  Female  Clippers  NaN  NaN